Autodesk.Revit.DB.TableData.IsValidZoomLevel(System.Int32)
Verifies if the value of zoom level is valid.
zoomLevel:
The value of zoom level.
Returns:
True if the value of zoom level is inside of the acceptable range, false otherwise.
Since:
2019.2

Autodesk.Revit.DB.TableData.GetSectionData(System.Int32)
Returns the section data array element at the specified index.
nIndex:
The index of section data array. If the index is out of the boundary of section data array,
null is returned.

Autodesk.Revit.DB.TableData.GetSectionData(Autodesk.Revit.DB.SectionType)
Returns the pointer to the section data array element at the specified section type.
sectionType:
The section type of section data array. If the integral value of the section type is out of the boundary of section data array,
null is returned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.TableData.IsEqual(Autodesk.Revit.DB.TableData)
Checks if this element is equal in value to the other element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableData.Width
Gets or sets the table width in feet
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The table width is outside of the acceptable range.

Autodesk.Revit.DB.TableData.WidthInPixels
Gets the width of the panel schedule in logical pixels

Autodesk.Revit.DB.TableData.NumberOfSections
Gets the number of items in section data array.

Autodesk.Revit.DB.TableData.ZoomLevel
The value of zoom level for corresponding TableView.
Remarks:
This value is used to change the size of text fonts in tabular views, and then the size of rows, colums and cells
will also be changed to satisfy the text.
Note: This value is only used to improve the text readability in tabular view and will not change the size of texts, rows, columns and cells in sheet views.
Note: This value is temporary setting just for this session.
Note: This value is a percentage number which must be a multiple of 10 in the range of 10 to 400.
A value of 400 indicates the maximum zoom permitted. The default value for new created tabular views is 100.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value of zoom level must be a multiple of 10 in the range of 10 to 400.
Since:
2019.2

Autodesk.Revit.DB.TableData.FreezeColumnsAndRows
set to true if the columns and rows should be unmovable by the slider grips

Autodesk.Revit.DB.TableData
The TableData class is implemented to hold most of the data that describe
the style of the rows, columns, and cells in a table.